Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: 3. The method according to claim 1 or 2, wherein the first configuration information is further used to configure a time-frequency resource for the DCI.
de_de: 3. Verfahren nach Anspruch 1 oder 2, wobei die ersten Konfigurationsinformationen ferner verwendet werden, um eine Zeit-Frequenz-Ressource für die DCI zu konfigurieren.

source: 4. The method according to any one of claims 1 to3 wherein the time-frequency resource for the DCI is determined based on configuration information of a control resource set, CORESET, and configuration information of a search space.
de_de: 4. Verfahren nach einem der Ansprüche 1 bis 3, wobei die Zeit-Frequenz-Ressource für die DCI basierend auf Konfigurationsinformationen eines Steuerressourcensatzes (CORESET) und Konfigurationsinformationen eines Suchraums bestimmt wird.

source: 5. The method according to claim 3, wherein
de_de: 5. Verfahren nach Anspruch 3, wobei

source: that there is a correspondence between the cell identifier and the first configuration information is specifically: there is a correspondence between the cell identifier and a radio network temporary identifier and the time-frequency resource for the DCI; and
de_de: eine Entsprechung zwischen der Zellenkennung und den ersten Konfigurationsinformationen besteht, insbesondere: eine Entsprechung zwischen der Zellenkennung und einer temporären Funknetzwerkkennung und der Zeit-Frequenz-Ressource für die DCI, besteht; und

source: the obtaining first configuration information based on the cell identifier comprises:
de_de: das Erlangen erster Konfigurationsinformationen basierend auf der Zellenkennung umfasst:

source: obtaining the radio network temporary identifier and the time-frequency resource for the DCI based on the cell identifier.
de_de: Erlangen der temporären Funknetzwerkkennung und der Zeit-Frequenz-Ressource für die DCI basierend auf der Zellenkennung.

source: 6. The method according to claim 3, wherein
de_de: 6. Verfahren nach Anspruch 3, wobei

source: that there is a correspondence between the cell identifier and the first configuration information is specifically: there is a correspondence between the cell identifier and a radio network temporary identifier and the time-frequency resource for the DCI;
de_de: eine Entsprechung zwischen der Zellenkennung und den ersten Konfigurationsinformationen besteht, insbesondere: eine Entsprechung zwischen der Zellenkennung und einer temporären Funknetzwerkkennung und der Zeit-Frequenz-Ressource für die DCI, besteht;

source: the method further comprises:
de_de: wobei das Verfahren ferner Folgendes umfasst:

source: obtaining a synchronization signal block index, wherein there is a correspondence between the synchronization signal block index and the time-frequency resource for the DCI; and
de_de: Erlangen eines Synchronisationssignal-Blockindex, wobei eine Entsprechung zwischen dem Synchronisationssignal-Blockindex und der Zeit-Frequenz-Ressource für die DCI besteht; und

source: obtaining the radio network temporary identifier based on the cell identifier; and
de_de: Erlangen der temporären Funknetzwerkkennung basierend auf der Zellenkennung; und

source: obtaining the time-frequency resource for the DCI based on the cell identifier and the synchronization signal block index.
de_de: Erlangen der Zeit-Frequenz-Ressource für die DCI basierend auf der Zellenkennung und dem Synchronisationssignal-Blockindex.

source: 7. The method according to any one of claims 1 to 6, wherein the first configuration information is invalid when a timer corresponding to the first configuration information expires.
de_de: 7. Verfahren nach einem der Ansprüche 1 bis 6, wobei die ersten Konfigurationsinformationen ungültig werden, wenn ein den ersten Konfigurationsinformationen entsprechender Timer abläuft.

source: 8. The method according to any one of claims 1 to 7, wherein the first configuration information is invalid when a terminal device is in radio resource control connected mode.
de_de: 8. Verfahren nach einem der Ansprüche 1 bis 7, wobei die ersten Konfigurationsinformationen ungültig sind, wenn ein Endgerät in einem verbundenen Modus der Funkressourcensteuerung ist.

source: 9. The method according to any one of claims 1 to 6, wherein the first configuration information is invalid when data fails to be transmitted by using the radio network temporary identifier.
de_de: 9. Verfahren nach einem der Ansprüche 1 bis 6, wobei die ersten Konfigurationsinformationen ungültig sind, wenn eine Datenübertragung mithilfe der temporären Funknetzwerkkennung fehlschlägt.

source: A terminal device or a component of the terminal device wherein the terminal device or the component of the terminal device is configured to perform the method according to any one of claims 1 to 9.
de_de: Endgerät oder eine Komponente des Endgeräts, wobei das Endgerät oder die Komponente des Endgeräts konfiguriert ist, um das Verfahren nach einem der Ansprüche 1 bis 9 auszuführen.

source: A computer-readable storage medium, storing a computer program or instructions, wherein when the computer program or instructions are executed, a terminal device or a component of the terminal device is enabled to perform the method according to any one of claims 1 to 9.
de_de: Computerlesbares Speichermedium, das ein Computerprogramm oder Anweisungen speichert, wobei, wenn das Computerprogramm oder die Anweisungen ausgeführt werden, ein Endgerät oder eine Komponente des Endgeräts in die Lage versetzt wird, das Verfahren nach einem der Ansprüche 1 bis 9 durchzuführen.

source: A chip, comprising a processor, wherein the processor is coupled to a memory, the memory is configured to store a program or instructions, and when the program or the instructions are executed by the processor, a terminal device or a component of the terminal device is enabled to perform the method according to any one of claims 1 to 8.
de_de: Chip, umfassend einen Prozessor, wobei der Prozessor mit einem Speicher gekoppelt ist, wobei der Speicher konfiguriert ist, um ein Programm oder Anweisungen zu speichern, und, wenn das Programm oder die Anweisungen durch den Prozessor ausgeführt werden, ein Endgerät oder eine Komponente des Endgeräts in die Lage versetzt wird, das Verfahren nach einem der Ansprüche 1 bis 8 durchzuführen.

source: 1. A device comprising:
de_de: 1. Vorrichtung, umfassend:

source: a dielectric device cover (215); and
de_de: eine Abdeckung für eine dielektrische Vorrichtung (215); und

source: an antenna system (205) underneath the dielectric device cover,
de_de: ein Antennensystem (205) unterhalb der Abdeckung für eine dielektrische Vorrichtung,

source: wherein the antenna system is for 5G mmWaves above 24 GHz,
de_de: wobei das Antennensystem für 5G-mm-Wellen über 24 GHz ist,

source: wherein the antenna system is an antenna in package, AiP,
de_de: wobei das Antennensystem eine In-Package-Antenne, AiP, ist,

source: wherein the dielectric device cover (215) is bigger than 10 times of the size of the antenna system (205), and is separated from the antenna system (205) in a first dimension with a distance less than 3.8mm; and
de_de: wobei die Abdeckung für eine dielektrische Vorrichtung (215) größer als das 10-fache der Größe des Antennensystems (205) ist und von dem Antennensystem (205) in einer ersten Abmessung mit einem Abstand von weniger als 3,8 mm getrennt ist; und

source: wherein the dielectric device cover (215) comprises a perfect magnetic conductor, PMC, equivalent material (235) surrounding the antenna system (205) without overlapping the antenna system, and wherein the PMC equivalent material (235) is configured using an artificial EM material with a structure comprising an electromagnetic band gap, EBG, structure or a photonic bandgap, PBG, structure.
de_de: wobei die Abdeckung für eine dielektrische Vorrichtung (215) ein Material, das einem perfekten magnetischen Leiter äquivalent ist, PMC-äquivalentes Material (235), umfasst, das das Antennensystem (205) umgibt, ohne das Antennensystem zu überlappen, und wobei das PMC-äquivalente Material (235) unter Verwendung eines künstlichen EM-Materials mit einer Struktur, die eine elektromagnetische Bandlückenstruktur, EBG-Struktur, oder eine photonische Bandlückenstruktur, PBG-Struktur, umfasst, konfiguriert ist.

source: 2. The device of claim 1, wherein the antenna system comprises one or more antenna system elements.
de_de: 2. Vorrichtung nach Anspruch 1, wobei das Antennensystem ein oder mehrere Antennensystemelemente umfasst.

source: 3. The device of any one of preceding claims, wherein the antenna system (205) comprises one or more antennas configured to operate in mmWave frequency.
de_de: 3. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei das Antennensystem (205) eine oder mehrere Antennen umfasst, die konfiguriert sind, um in der mm-Wellenfrequenz zu arbeiten.

source: 4. The device of any one of preceding claims, wherein the dielectric device cover (215) serves as a superstrate of the antenna system, and the PMC equivalent material is disposed on a surface of the dielectric device cover facing towards the antenna system.
de_de: 4. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei die Abdeckung für eine dielektrische Vorrichtung (215) als ein Superstrat des Antennensystems dient und das PMC-äquivalente Material auf einer Oberfläche der Abdeckung für eine dielektrische Vorrichtung angeordnet ist, die dem Antennensystem zugewandt ist.

source: 5. The device of any one of preceding claims, wherein the PMC equivalent material (235) is of a width equal to or larger than λd/2, wherein λd is an effective wavelength of a guided wave emitted by the antenna system (205) in the dielectric device cover (215).
de_de: 5. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei das PMC-äquivalente Material (235) eine Breite aufweist, die gleich oder größer als λd/2 ist, wobei λd eine effektive Wellenlänge einer geführten Welle ist, die von dem Antennensystem (205) in der Abdeckung für eine dielektrische Vorrichtung (215) emittiert wird.

source: 6. The device of any one of preceding claims, wherein the structure is configured to suppress microwaves inside of the dielectric device cover (215).
de_de: 6. Vorrichtung nach einem der vorhergehenden Ansprüche, wobei die Struktur konfiguriert ist, um Mikrowellen innerhalb der Abdeckung für eine dielektrische Vorrichtung (215) zu unterdrücken.

source: 7. The device of any one of claims 1 to 6, wherein the PMC equivalent material (235) comprises a plurality of metallic elements, wherein a shape and dimension of each of the plurality of metallic elements are determined based on dielectric parameters of the dielectric device cover and a distance between the dielectric device cover and the antenna system.
de_de: 7. Vorrichtung nach einem der Ansprüche 1 bis 6, wobei das PMC-äquivalente Material (235) eine Vielzahl von metallischen Elementen umfasst, wobei eine Form und Abmessung jedes der Vielzahl von metallischen Elementen basierend auf dielektrischen Parametern der Abdeckung für eine dielektrische Vorrichtung und einem Abstand zwischen der Abdeckung für eine dielektrische Vorrichtung und dem Antennensystem bestimmt werden.

source: 8. The device of any one of claims 1 to 6, wherein the PMC equivalent material (235) comprises a plurality of holes in a dielectric substrate.
de_de: 8. Vorrichtung nach einem der Ansprüche 1 bis 6, wobei das PMC-äquivalente Material (235) eine Vielzahl von Löchern in einem dielektrischen Substrat umfasst.

source: 9. The device of claim 8, wherein
de_de: 9. Vorrichtung nach Anspruch 8, wobei

source: the plurality of holes are circular holes (564), and the diameters of the circular holes (564) are in the range of 0.3∼0.8mm.
de_de: die mehreren Löcher kreisförmige Löcher (564) sind und die Durchmesser der kreisförmigen Löcher (564) im Bereich von 0,3 bis 0,8 mm sind.

source: The device of any one of preceding claims, wherein the distance between the dielectric device cover (215) and the antenna system (205) is less than 3mm, and wherein a surface of the PMC equivalent material (235) and the antenna system (205) are separated in the first dimension.
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche, wobei der Abstand zwischen der Abdeckung für eine dielektrische Vorrichtung (215) und dem Antennensystem (205) weniger als 3 mm ist und wobei eine Oberfläche des PMC-äquivalenten Materials (235) und das Antennensystem (205) gemäß der ersten Abmessung getrennt sind.

source: The device of any one of preceding claim, wherein the PMC equivalent material (235) forms a loop, a ring, a closed path, or a U shape surrounding the antenna system (205).
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche, wobei das PMC-äquivalente Material (235) eine Schleife, einen Ring, einen geschlossenen Pfad oder eine U-Form ausbildet, die das Antennensystem (205) umgibt.

source: The device of any one of preceding claim, wherein the device is a mobile phone, the dielectric device cover (215) comprises a mobile phone front cover that covering a front side of the mobile phone, the front side comprising a screen of the mobile phone; or
de_de: Vorrichtung nach einem der vorhergehenden Ansprüche, wobei die Vorrichtung ein Mobiltelefon ist, die Abdeckung für eine dielektrische Vorrichtung (215) eine vordere Mobiltelefonabdeckung umfasst, die eine Vorderseite des Mobiltelefons abdeckt, wobei die Vorderseite einen Bildschirm des Mobiltelefons umfasst; oder

source: the dielectric device cover comprises a mobile phone back cover that covering a back side of the mobile phone, the back side opposing a screen of the mobile phone; or the dielectric device cover comprises a mobile phone side or edge cover that covering a side or edge of the mobile phone, the side or edge of the mobile phone being peripheral to a screen of the mobile phone.
de_de: die Abdeckung für eine dielektrische Vorrichtung eine hintere Mobiltelefonabdeckung umfasst, die eine Rückseite des Mobiltelefons abdeckt, wobei die Rückseite einem Bildschirm des Mobiltelefons gegenüberliegt; oder die Abdeckung für eine dielektrische Vorrichtung eine Seiten- oder Kantenabdeckung des Mobiltelefons umfasst, die eine Seite oder Kante des Mobiltelefons abdeckt, wobei die Seite oder Kante des Mobiltelefons peripher zu einem Bildschirm des Mobiltelefons ist.

source: A method of controlling electromagnetic, EM, waves generated by an antenna system (205) of a device according to any one of claims 1 to 12, comprising:
de_de: Verfahren zum Steuern elektromagnetischer Wellen, EM-Wellen, die durch ein Antennensystem (205) einer Vorrichtung nach einem der Ansprüche 1 bis 12 erzeugt werden, umfassend:

source: emitting EM waves with the antenna system (205); and
de_de: Emittieren von EM-Wellen mit dem Antennensystem (205); und

source: controlling the emitted EM with a dielectric device cover (215) positioned above and separated from the antenna system (205).
de_de: Steuern der emittierten EM mit einer Abdeckung für eine dielektrische Vorrichtung (215), die über dem Antennensystem (205) positioniert und davon getrennt ist.

source: The method of claim 13, wherein the antenna system (205) is perpendicularly mounted on a ground plane of the device, and the dielectric device cover (215) covers the antenna system (205) and the ground plane, and wherein the EM waves comprises one or more guided waves inside of the dielectric device cover (215) or surface waves on the ground plane.
de_de: Verfahren nach Anspruch 13, wobei das Antennensystem (205) senkrecht auf einer Grundfläche der Vorrichtung montiert ist und die Abdeckung für eine dielektrische Vorrichtung (215) das Antennensystem (205) und die Grundfläche abdeckt, und wobei die EM-Wellen eine oder mehrere geführte Wellen innerhalb der Abdeckung für eine dielektrische Vorrichtung (215) oder Oberflächenwellen auf der Grundfläche umfassen.

source: 1. A method for measuring channel state information, CSI, wherein the method is performed by a terminal device (102, …, 107) or a component of a terminal device (102, …, 107), and the method comprises:
de_de: 1. Verfahren zum Messen von Kanalzustandsinformationen (CSI), wobei das Verfahren von einem Endgerät (102, …, 107) oder einer Komponente eines Endgeräts (102, …, 107) durchgeführt wird und das Verfahren umfasst:

source: receiving (220) first indication information from a network device (101), wherein the first indication information indicates a plurality of frequency domain units in a downlink reference signal resource that are used by the terminal device (102, ..., 107) to obtain CSI; and
de_de: Empfangen (220) erster Anzeigeinformationen von einem Netzwerkgerät (101), wobei die ersten Anzeigeinformationen eine Vielzahl von Frequenzbereichseinheiten in einer Downlink-Referenzsignalressource anzeigen, die von dem Endgerät (102, ..., 107) zum Erlangen von CSI verwendet werden; und

source: performing (230) measurement in the frequency domain unit based on the first indication information to obtain the CSI;
de_de: Durchführen (230) einer Messung in der Frequenzbereichseinheit basierend auf den ersten Anzeigeinformationen, um die CSI zu erlangen;

source: wherein the first indication information comprises second indication information, indicating a start frequency domain unit in the frequency domain units;
de_de: wobei die ersten Anzeigeinformationen zweite Anzeigeinformationen umfassen, die eine Startfrequenzbereichseinheit in den Frequenzbereichseinheiten anzeigen;

source: wherein the first indication information further comprises third indication information, indicating a distribution density of the frequency domain units in the downlink reference signal resource; and
de_de: wobei die ersten Anzeigeinformationen ferner dritte Anzeigeinformationen umfassen, die eine Verteilungsdichte der Frequenzbereichseinheiten in der Downlink-Referenzsignalressource anzeigen; und

source: wherein the second indication information and the third indication information are indicated jointly.
de_de: wobei die zweiten Anzeigeinformationen und die dritten Anzeigeinformationen gemeinsam angezeigt werden.

source: 2. The method according to claim 1, wherein the first indication information comprises:
de_de: 2. Verfahren nach Anspruch 1, wobei dass die ersten Anzeigeinformationen umfassen:

source: fourth indication information, indicating a quantity of frequency domain unit groups into which the frequency domain units are grouped.
de_de: vierte Anzeigeinformationen, die eine Menge von Frequenzbereichseinheitgruppen anzeigen, in die die Frequenzbereichseinheiten gruppiert sind.

source: 3. The method according to claim 2, wherein the frequency domain unit groups correspond to different downlink reference signal ports, and a correspondence between the frequency domain unit groups and the different downlink reference signal ports is preset or is indicated by fifth indication information comprised in the first indication information.
de_de: 3. Verfahren nach Anspruch 2, wobei die Frequenzbereichseinheitgruppen unterschiedlichen Downlink-Referenzsignalports entsprechen und eine Entsprechung zwischen den Frequenzbereichseinheitgruppen und den unterschiedlichen Downlink-Referenzsignalports voreingestellt ist oder durch fünfte Anzeigeinformationen angezeigt wird, die in den ersten Anzeigeinformationen enthalten sind.

source: 4. A method for configuring channel state information CSI measurement, wherein the method is performed by a network device (101) or a component of a network device (101), and the method comprises:
de_de: 4. Verfahren zum Konfigurieren einer Kanalzustandsinformationsmessung (CSI-Messung), wobei das Verfahren von einem Netzwerkgerät (101) oder einer Komponente eines Netzwerkgeräts (101) durchgeführt wird und das Verfahren umfasst:

source: generating (210) first indication information, wherein the first indication information indicates a plurality of frequency domain units in a downlink reference signal resource that are used by a terminal device (102, …, 107) to obtain CSI; and
de_de: Empfangen (210) erster Anzeigeinformationen, wobei die ersten Anzeigeinformationen eine Vielzahl von Frequenzbereichseinheiten in einer Downlink-Referenzsignalressource anzeigen, die von dem Endgerät (102, ..., 107) zum Erlangen von CSI verwendet werden; und

source: sending (220) the first indication information;
de_de: Senden (S220) der ersten Anzeigeinformationen;

source: wherein the first indication information further comprises third indication information, indicating distribution density of the frequency domain units in the downlink reference signal resource; and
de_de: wobei die ersten Anzeigeinformationen ferner dritte Anzeigeinformationen umfassen, die eine Verteilungsdichte der Frequenzbereichseinheiten in der Downlink-Referenzsignalressource anzeigen; und

source: 5. The method according to claim 4, wherein the first indication information comprises:
de_de: 5. Verfahren nach Anspruch 4, wobei die ersten Anzeigeinformationen umfassen:

source: 6. The method according to claim 5, wherein the frequency domain unit groups correspond to different downlink reference signal ports, and a correspondence between the frequency domain unit groups and the different downlink reference signal ports is preset or is indicated by fifth indication information comprised in the first indication information.
de_de: 6. Verfahren nach Anspruch 5, wobei die Frequenzbereichseinheitgruppen unterschiedlichen Downlink-Referenzsignalports entsprechen und eine Entsprechung zwischen den Frequenzbereichseinheitgruppen und den unterschiedlichen Downlink-Referenzsignalports voreingestellt ist oder durch fünfte Anzeigeinformationen angezeigt wird, die in den ersten Anzeigeinformationen enthalten sind.

source: 7. A communication apparatus (102, …, 107), comprising at least one processor and a communication interface, wherein the communication interface is configured to input and/or output a signal, and the at least one processor is configured to execute a computer program stored in a memory, to enable the communication apparatus to implement the method according to any one of claims 1 to 3, and wherein the communication apparatus is a terminal device or a component of a terminal device.
de_de: 7. Kommunikationsvorrichtung (102, …, 107), die mindestens einen Prozessor und eine Kommunikationsschnittstelle umfasst, wobei die Kommunikationsschnittstelle zum Eingeben und/oder Ausgeben eines Signals konfiguriert ist und der mindestens eine Prozessor zum Ausführen eines in einem Speicher gespeicherten Computerprogramms konfiguriert ist, um die Kommunikationsvorrichtung in die Lage zu versetzen, das Verfahren nach einem der Ansprüche 1 bis 3 zu implementieren, und wobei die Kommunikationsvorrichtung ein Endgerät oder eine Komponente eines Endgeräts ist.
